Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/psm.h
// -----------------------------------------------------------------------------
// Field       : PSM_WDSEL_RESETS
#define PSM_WDSEL_RESETS_RESET  _u(0x0)
#define PSM_WDSEL_RESETS_BITS   _u(0x00000010)
#define PSM_WDSEL_RESETS_MSB    _u(4)
#define PSM_WDSEL_RESETS_LSB    _u(4)
#define PSM_WDSEL_RESETS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PSM_WDSEL_XOSC
#define PSM_WDSEL_XOSC_RESET  _u(0x0)
#define PSM_WDSEL_XOSC_BITS   _u(0x00000008)
#define PSM_WDSEL_XOSC_MSB    _u(3)
#define PSM_WDSEL_XOSC_LSB    _u(3)
#define PSM_WDSEL_XOSC_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PSM_WDSEL_ROSC
#define PSM_WDSEL_ROSC_RESET  _u(0x0)
#define PSM_WDSEL_ROSC_BITS   _u(0x00000004)
#define PSM_WDSEL_ROSC_MSB    _u(2)
#define PSM_WDSEL_ROSC_LSB    _u(2)
#define PSM_WDSEL_ROSC_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PSM_WDSEL_OTP
#define PSM_WDSEL_OTP_RESET  _u(0x0)
#define PSM_WDSEL_OTP_BITS   _u(0x00000002)
#define PSM_WDSEL_OTP_MSB    _u(1)
#define PSM_WDSEL_OTP_LSB    _u(1)
#define PSM_WDSEL_OTP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PSM_WDSEL_PROC_COLD
#define PSM_WDSEL_PROC_COLD_RESET  _u(0x0)
#define PSM_WDSEL_PROC_COLD_BITS   _u(0x00000001)
#define PSM_WDSEL_PROC_COLD_MSB    _u(0)
#define PSM_WDSEL_PROC_COLD_LSB    _u(0)
#define PSM_WDSEL_PROC_COLD_ACCESS "RW"
// =============================================================================
// Register    : PSM_DONE
// Description : Is the subsystem ready?
#define PSM_DONE_OFFSET _u(0x0000000c)
#define PSM_DONE_BITS   _u(0x01ffffff)
#define PSM_DONE_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_PROC1
#define PSM_DONE_PROC1_RESET  _u(0x0)
#define PSM_DONE_PROC1_BITS   _u(0x01000000)
#define PSM_DONE_PROC1_MSB    _u(24)
#define PSM_DONE_PROC1_LSB    _u(24)
#define PSM_DONE_PROC1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_PROC0
#define PSM_DONE_PROC0_RESET  _u(0x0)
#define PSM_DONE_PROC0_BITS   _u(0x00800000)
#define PSM_DONE_PROC0_MSB    _u(23)
#define PSM_DONE_PROC0_LSB    _u(23)
#define PSM_DONE_PROC0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_ACCESSCTRL
#define PSM_DONE_ACCESSCTRL_RESET  _u(0x0)
#define PSM_DONE_ACCESSCTRL_BITS   _u(0x00400000)
#define PSM_DONE_ACCESSCTRL_MSB    _u(22)
#define PSM_DONE_ACCESSCTRL_LSB    _u(22)
#define PSM_DONE_ACCESSCTRL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_SIO
#define PSM_DONE_SIO_RESET  _u(0x0)
#define PSM_DONE_SIO_BITS   _u(0x00200000)
#define PSM_DONE_SIO_MSB    _u(21)
#define PSM_DONE_SIO_LSB    _u(21)
#define PSM_DONE_SIO_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_XIP
#define PSM_DONE_XIP_RESET  _u(0x0)
#define PSM_DONE_XIP_BITS   _u(0x00100000)
#define PSM_DONE_XIP_MSB    _u(20)
#define PSM_DONE_XIP_LSB    _u(20)
#define PSM_DONE_XIP_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_SRAM9
#define PSM_DONE_SRAM9_RESET  _u(0x0)
#define PSM_DONE_SRAM9_BITS   _u(0x00080000)
#define PSM_DONE_SRAM9_MSB    _u(19)
#define PSM_DONE_SRAM9_LSB    _u(19)
#define PSM_DONE_SRAM9_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_SRAM8
#define PSM_DONE_SRAM8_RESET  _u(0x0)
#define PSM_DONE_SRAM8_BITS   _u(0x00040000)
#define PSM_DONE_SRAM8_MSB    _u(18)
#define PSM_DONE_SRAM8_LSB    _u(18)
#define PSM_DONE_SRAM8_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_SRAM7
#define PSM_DONE_SRAM7_RESET  _u(0x0)
#define PSM_DONE_SRAM7_BITS   _u(0x00020000)
#define PSM_DONE_SRAM7_MSB    _u(17)
#define PSM_DONE_SRAM7_LSB    _u(17)
#define PSM_DONE_SRAM7_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_SRAM6
#define PSM_DONE_SRAM6_RESET  _u(0x0)
#define PSM_DONE_SRAM6_BITS   _u(0x00010000)
#define PSM_DONE_SRAM6_MSB    _u(16)
#define PSM_DONE_SRAM6_LSB    _u(16)
#define PSM_DONE_SRAM6_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_SRAM5
#define PSM_DONE_SRAM5_RESET  _u(0x0)
#define PSM_DONE_SRAM5_BITS   _u(0x00008000)
#define PSM_DONE_SRAM5_MSB    _u(15)
#define PSM_DONE_SRAM5_LSB    _u(15)
#define PSM_DONE_SRAM5_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_SRAM4
#define PSM_DONE_SRAM4_RESET  _u(0x0)
#define PSM_DONE_SRAM4_BITS   _u(0x00004000)
#define PSM_DONE_SRAM4_MSB    _u(14)
#define PSM_DONE_SRAM4_LSB    _u(14)
#define PSM_DONE_SRAM4_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_SRAM3
#define PSM_DONE_SRAM3_RESET  _u(0x0)
#define PSM_DONE_SRAM3_BITS   _u(0x00002000)
#define PSM_DONE_SRAM3_MSB    _u(13)
#define PSM_DONE_SRAM3_LSB    _u(13)
#define PSM_DONE_SRAM3_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_SRAM2
#define PSM_DONE_SRAM2_RESET  _u(0x0)
#define PSM_DONE_SRAM2_BITS   _u(0x00001000)
#define PSM_DONE_SRAM2_MSB    _u(12)
#define PSM_DONE_SRAM2_LSB    _u(12)
#define PSM_DONE_SRAM2_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_SRAM1
#define PSM_DONE_SRAM1_RESET  _u(0x0)
#define PSM_DONE_SRAM1_BITS   _u(0x00000800)
#define PSM_DONE_SRAM1_MSB    _u(11)
#define PSM_DONE_SRAM1_LSB    _u(11)
#define PSM_DONE_SRAM1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_SRAM0
#define PSM_DONE_SRAM0_RESET  _u(0x0)
#define PSM_DONE_SRAM0_BITS   _u(0x00000400)
#define PSM_DONE_SRAM0_MSB    _u(10)
#define PSM_DONE_SRAM0_LSB    _u(10)
#define PSM_DONE_SRAM0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_BOOTRAM
#define PSM_DONE_BOOTRAM_RESET  _u(0x0)
#define PSM_DONE_BOOTRAM_BITS   _u(0x00000200)
#define PSM_DONE_BOOTRAM_MSB    _u(9)
#define PSM_DONE_BOOTRAM_LSB    _u(9)
#define PSM_DONE_BOOTRAM_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_ROM
#define PSM_DONE_ROM_RESET  _u(0x0)
#define PSM_DONE_ROM_BITS   _u(0x00000100)
#define PSM_DONE_ROM_MSB    _u(8)
#define PSM_DONE_ROM_LSB    _u(8)
#define PSM_DONE_ROM_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_BUSFABRIC
#define PSM_DONE_BUSFABRIC_RESET  _u(0x0)
#define PSM_DONE_BUSFABRIC_BITS   _u(0x00000080)
#define PSM_DONE_BUSFABRIC_MSB    _u(7)
#define PSM_DONE_BUSFABRIC_LSB    _u(7)
#define PSM_DONE_BUSFABRIC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_PSM_READY
#define PSM_DONE_PSM_READY_RESET  _u(0x0)
#define PSM_DONE_PSM_READY_BITS   _u(0x00000040)
#define PSM_DONE_PSM_READY_MSB    _u(6)
#define PSM_DONE_PSM_READY_LSB    _u(6)
#define PSM_DONE_PSM_READY_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_CLOCKS
#define PSM_DONE_CLOCKS_RESET  _u(0x0)
#define PSM_DONE_CLOCKS_BITS   _u(0x00000020)
#define PSM_DONE_CLOCKS_MSB    _u(5)
#define PSM_DONE_CLOCKS_LSB    _u(5)
#define PSM_DONE_CLOCKS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_RESETS
#define PSM_DONE_RESETS_RESET  _u(0x0)
#define PSM_DONE_RESETS_BITS   _u(0x00000010)
#define PSM_DONE_RESETS_MSB    _u(4)
#define PSM_DONE_RESETS_LSB    _u(4)
#define PSM_DONE_RESETS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_XOSC
#define PSM_DONE_XOSC_RESET  _u(0x0)
#define PSM_DONE_XOSC_BITS   _u(0x00000008)
#define PSM_DONE_XOSC_MSB    _u(3)
#define PSM_DONE_XOSC_LSB    _u(3)
#define PSM_DONE_XOSC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_ROSC
#define PSM_DONE_ROSC_RESET  _u(0x0)
#define PSM_DONE_ROSC_BITS   _u(0x00000004)
#define PSM_DONE_ROSC_MSB    _u(2)
#define PSM_DONE_ROSC_LSB    _u(2)
#define PSM_DONE_ROSC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_OTP
#define PSM_DONE_OTP_RESET  _u(0x0)
#define PSM_DONE_OTP_BITS   _u(0x00000002)
#define PSM_DONE_OTP_MSB    _u(1)
#define PSM_DONE_OTP_LSB    _u(1)
#define PSM_DONE_OTP_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PSM_DONE_PROC_COLD
#define PSM_DONE_PROC_COLD_RESET  _u(0x0)
#define PSM_DONE_PROC_COLD_BITS   _u(0x00000001)
#define PSM_DONE_PROC_COLD_MSB    _u(0)
#define PSM_DONE_PROC_COLD_LSB    _u(0)
#define PSM_DONE_PROC_COLD_ACCESS "RO"
// =============================================================================
#endif // _HARDWARE_REGS_PSM_H

